[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationrequests) => ({
-    url: "/api/recommendationrequests",
-    method: "PUT",
-    params: {
-      id: recommendationrequests.id,
-    },
-    data: {
-      requesterEmail: recommendationrequests.requesterEmail,
-      professorEmail: recommendationrequests.professorEmail,
-      explanation: recommendationrequests.explanation,
-      dateRequested: recommendationrequests.dateRequested,
-      dateNeeded: recommendationrequests.dateNeeded,
-      done: recommendationrequests.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationrequests) => {
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "RecommendationRequest Updated - id: 17 requesterEmail: riasinghedit",

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (recommendationrequests) => ({
-    url: "/api/recommendationrequests",
+    url: "",
     method: "PUT",
     params: {
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "RecommendationRequest Updated - id: 17 requesterEmail: riasinghedit",

[Killed] ConditionalExpression
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequests</h1>
-        {recommendationRequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequests}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequests</h1>
-        {recommendationRequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequests}
-          />
-        )}
+        {recommendationRequests || <RecommendationRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={recommendationRequests} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
