[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:54:46
               id="requesterEmail"
               type="email"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Requester Email is required.",
-                pattern: {
-                  value: /^\S+@\S+\.\S+$/,
-                  message: "Requester Email must be a valid email address.",
-                },
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Requester Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.jsx:57:26
               {...register("requesterEmail", {
                 required: "Requester Email is required.",
                 pattern: {
-                  value: /^\S+@\S+\.\S+$/,
+                  value: /^\S+@\S+\.\S$/,
                   message: "Requester Email must be a valid email address.",
                 },
killedBy: HelpRequestForm tests that email validation rejects extra text around an email address
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Requester Email must be a valid email address.
</div> instead

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.jsx:57:26
               {...register("requesterEmail", {
                 required: "Requester Email is required.",
                 pattern: {
-                  value: /^\S+@\S+\.\S+$/,
+                  value: /^\S+@\S+\.\S+/,
                   message: "Requester Email must be a valid email address.",
                 },
killedBy: HelpRequestForm tests that email validation rejects extra text around an email address
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""
