[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.jsx:65:13
     {
       header: "Solved",
       accessorKey: "solved",
-      cell: ({ getValue }) => getValue().toString(),
+      cell: () => undefined,
     },
   ];
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
