[Killed] ArrowFunction
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:8:33
 import { useNavigate } from "react-router";
 import { hasRole } from "main/utils/useCurrentUser";
 
-const cellToAxiosParamsDelete = (cell) => ({
-  url: "/api/UCSBDiningCommonsMenuItem",
-  method: "DELETE",
-  params: {
-    id: cell.row.original.id,
-  },
-});
+const cellToAxiosParamsDelete = () => undefined;
 
 const onDeleteSuccess = () => {};
killedBy: UCSBDiningCommonsMenuItemTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:47:5
       header: "id",
       accessorKey: "id",
     },
-    {
-      header: "Dining Commons Code",
-      accessorKey: "diningCommonsCode",
-    },
+    {},
     {
       header: "Name",
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
