[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestIndexPage.jsx:18:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/HelpRequest/all"],
-    { method: "GET", url: "/api/HelpRequest/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HelpRequestIndexPage tests renders three HelpRequests correctly for regular user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
