[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:54:46
               id="requesterEmail"
               type="email"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Requester Email is required.",
-                pattern: {
-                  value: /\S+@\S+\.\S+/,
-                  message: "Requester Email must be a valid email address.",
-                },
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestEditPage tests does not submit invalid data
statusReason: Unable to find an element with the text: Requester Email is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.jsx:57:26
               {...register("requesterEmail", {
                 required: "Requester Email is required.",
                 pattern: {
-                  value: /\S+@\S+\.\S+/,
+                  value: /\S+@\S+\.\s+/,
                   message: "Requester Email must be a valid email address.",
                 },
killedBy: HelpRequestEditPage tests is populated with the data provided and submits updates
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.jsx:57:26
               {...register("requesterEmail", {
                 required: "Requester Email is required.",
                 pattern: {
-                  value: /\S+@\S+\.\S+/,
+                  value: /\S+@\S\.\S+/,
                   message: "Requester Email must be a valid email address.",
                 },
killedBy: HelpRequestEditPage tests is populated with the data provided and submits updates
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:118:26
               isInvalid={Boolean(errors.requestTime)}
               {...register("requestTime", {
                 required: "Request Time is required.",
-                pattern: {
-                  value: isodate_regex,
-                  message: "Request Time must be in ISO format.",
-                },
+                pattern: {},
               })}
             />

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:154:43
           <Form.Group className="mb-3">
             <Form.Label htmlFor="solved">Solved</Form.Label>
             <Form.Select
-              data-testid={testIdPrefix + "-solved"}
+              data-testid={testIdPrefix + ""}
               id="solved"
               isInvalid={Boolean(errors.solved)}
killedBy: HelpRequestForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
