[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:45:7
 
   const onSuccess = (helpRequest) => {
     toast(
-      `HelpRequest Updated - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: HelpRequestEditPage tests is populated with the data provided and submits updates
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "HelpRequest Updated - id: 1 requesterEmail: updated@ucsb.edu",
