[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:50:42
           id="requesterEmail"
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "requesterEmail is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /requesterEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestForm.jsx:108:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateRequested && "dateRequested is required. "}
+          {errors.dateRequested || "dateRequested is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /requesterEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestForm.jsx:125:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateNeeded && "dateNeeded is required. "}
+          {errors.dateNeeded || "dateNeeded is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /requesterEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
