[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:47:5
       header: "requesterEmail",
       accessorKey: "requesterEmail",
     },
-    {
-      header: "professorEmail",
-      accessorKey: "professorEmail",
-    },
+    {},
     {
       header: "explanation",
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:49:20
     },
     {
       header: "professorEmail",
-      accessorKey: "professorEmail",
+      accessorKey: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  riasingh
Received:

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:55:5
       header: "explanation",
       accessorKey: "explanation",
     },
-    {
-      header: "dateRequested",
-      accessorKey: "dateRequested",
-    },
+    {},
     {
       header: "dateNeeded",
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:56:15
       accessorKey: "explanation",
     },
     {
-      header: "dateRequested",
+      header: "",
       accessorKey: "dateRequested",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: dateRequested. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:63:5
       header: "dateNeeded",
       accessorKey: "dateNeeded",
     },
-    {
-      header: "done",
-      accessorKey: "done",
-    },
+    {},
   ];
 
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
