[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:10:31
 export default function RecommendationRequestsCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (recommendationrequests) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationrequests.requesterEmail,
-      professorEmail: recommendationrequests.professorEmail,
-      explanation: recommendationrequests.explanation,
-      dateRequested: recommendationrequests.dateRequested,
-      dateNeeded: recommendationrequests.dateNeeded,
-      done: recommendationrequests.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationrequests) => {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:11:10
   storybook = false,
 }) {
   const objectToAxiosParams = (recommendationrequests) => ({
-    url: "/api/recommendationrequests/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New RecommendationRequest Created - id: 2 requesterEmail: riasingh@ucsb.edu",

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:13:13
   const objectToAxiosParams = (recommendationrequests) => ({
     url: "/api/recommendationrequests/post",
     method: "POST",
-    params: {
-      requesterEmail: recommendationrequests.requesterEmail,
-      professorEmail: recommendationrequests.professorEmail,
-      explanation: recommendationrequests.explanation,
-      dateRequested: recommendationrequests.dateRequested,
-      dateNeeded: recommendationrequests.dateNeeded,
-      done: recommendationrequests.done,
-    },
+    params: {},
   });
 
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected {} to deeply equal { …(6) }

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:23:49
     },
   });
 
-  const onSuccess = (recommendationrequests) => {
-    toast(
-      `New RecommendationRequest Created - id: ${recommendationrequests.id} requesterEmail: ${recommendationrequests.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationrequests) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
